<?php
defined('BASEPATH') OR exit('No direct script access allowed');

/*
 |--------------------------------------------------------------------------
 | 网站基本设置
 |--------------------------------------------------------------------------
 |
 | 到你的根目录。通常这将是您的基本URL
 | 用斜线/
 |
 |	'http://meiyoufan.com/'
 |
 | 警告：必须设置此值！
 |
 | 如果没有设置，那么CodeIgniter会猜协议和路径
 | 安装，但由于安全问题主机将
 | 至_server [ 'server_addr ]如果可用，否则或本地主机
 | 自动检测机构的存在只是为了方便，在
 | 发展，不得用于生产！
 |
 | 如果你需要允许多个域，记住，这个文件仍然是
 | PHP脚本，您可以轻松地做你自己。.
 |
 */
$config['base_url'] = 'http://gwehzz.bocgi.com.cn/';

/*
 |--------------------------------------------------------------------------
 | 索引文件
 |--------------------------------------------------------------------------
 |
 |通常，这将是你的index.php文件，除非你将它改名为
 |别的东西。如果你使用的是mod_rewrite删除页面设置
 |的变量，是空白的。
 */
$config['index_page'] = 'index.php';

/*
 |--------------------------------------------------------------------------
 | URI协议
 |--------------------------------------------------------------------------
 |
 | 这项决定服务器全球应用于检索
 | URI字符串。“request_uri对于大多数服务器工作的默认设置。
 | 如果你|链接似乎不工作，尝试另一种可口的味道：
 |
 | 'REQUEST_URI'    Uses $_SERVER['REQUEST_URI']
 | 'QUERY_STRING'   Uses $_SERVER['QUERY_STRING']
 | 'PATH_INFO'      Uses $_SERVER['PATH_INFO']
 |
 | 警告：如果你设置为“path_info，URI将永远是URL解码！*/
$config['uri_protocol']	= 'REQUEST_URI';
/*
 |--------------------------------------------------------------------------
 | URL 后缀
 |--------------------------------------------------------------------------
 |
 |这个选项允许你添加一个后缀的所有URL生成CodeIgniter。
 |的更多信息，请参阅用户指南：
 |
 | https://codeigniter.com/user_guide/general/urls.html
 */
$config['url_suffix'] = '';

/*
 |--------------------------------------------------------------------------
 | 默认语言
 |--------------------------------------------------------------------------
 |
 | 决定哪套语言文件应使用。确保
 | 如果你打算使用其他的东西有一个可用的翻译
 | 比英语。
 |
 */
$config['language']	= 'zh_cn';

/*
 |--------------------------------------------------------------------------
 | 默认字符集
 |--------------------------------------------------------------------------
 |
 | 这决定字符集的默认使用的各种方法
 | 需要字符集可以提供。
 |
 | See http://php.net/htmlspecialchars for a list of supported charsets.
 |
 */
$config['charset'] = 'UTF-8';

/*
 |--------------------------------------------------------------------------
 | 启用/禁用系统钩子
 |--------------------------------------------------------------------------
 | 如果你想用“钩子”的功能，你必须使它通过
 | 设置此变量为真（布尔）。有关详细信息，请参见用户指南。
 |
 */
$config['enable_hooks'] = FALSE;

/*
 |--------------------------------------------------------------------------
 | 类扩展前缀
 |--------------------------------------------------------------------------
 | 此项允许您设置的文件名或类名前缀扩展时
 | 本地库。欲了解更多信息，请参阅用户指南：
 | https://codeigniter.com/user_guide/general/core_classes.html
 | https://codeigniter.com/user_guide/general/creating_libraries.html
 |
 */
$config['subclass_prefix'] = 'MY_';

/*
 |--------------------------------------------------------------------------
 | Composer 自动加载
 |--------------------------------------------------------------------------
 |
 | 启用这个设置会告诉CodeIgniter寻找Composer
 | application/vendor/autoload.php 自动装载机包脚本。
 |
 |	$config['composer_autoload'] = TRUE;
 |
 | 或者如果你有你的 vendor/ directory 位于其他地方，你
 | 可以选择设定一个具体的路径以及：
 |
 |	$config['composer_autoload'] = '/path/to/vendor/autoload.php';
 |
 |关于作曲家的更多信息，请访问http://getcomposer.org/
 |
 |注：这不会禁用或重写CodeIgniter具体
 |自动装填（application/config/autoload.php）
 */
$config['composer_autoload'] = FALSE;

/*
 |--------------------------------------------------------------------------
 | 允许URL字符
 |--------------------------------------------------------------------------
 |
 | 这让你指定的字符在URL允许你。
 | 当某人试图提交一个URL不允许字符会
 | 得到警告信息。
 |
 | 作为一种安全措施，强烈建议你限制的URL
 | 人物尽可能少。默认情况下，只有这些是允许的：A-Z 0-9 ~：_ %—
 |
 | 留下空白让所有的人物——但只有如果你是疯狂的。
 |
 | 配置的值实际上是一个正则表达式字符组
 | 和它将执行： ! preg_match('/^[<permitted_uri_chars>]+$/i
 |
 | 不改变除非你完全理解的影响！！
 |
 */
$config['permitted_uri_chars'] = 'a-z 0-9~%.:_\-';

/*
 |--------------------------------------------------------------------------
 | 使查询字符串
 |--------------------------------------------------------------------------
 |
 | 默认CodeIgniter使用搜索引擎友好的基于片段的URL：
 | example.com/who/what/where/
 |
 | 可以使基于标准的查询字符串的URL：
 | example.com?who=me&what=something&where=here
 |
 | 选项：true或false（布尔）
 |
 | 其他项目让你设置查询字符串的话，
 | 调用你的控制器及其功能：
 | example.com/index.php？c =控制器和m =函数
 |
 | 请注意一些助手不会像预期的那样工作的时候
 | 启用此功能，因为CodeIgniter的设计主要是为了
 | 使用基于片段的URL.
 |
 */
$config['enable_query_strings'] = FALSE;
$config['controller_trigger'] = 'c';
$config['function_trigger'] = 'm';
$config['directory_trigger'] = 'd';

/*
 |--------------------------------------------------------------------------
 | 允许 $_GET 阵列
 |--------------------------------------------------------------------------
 |
 | 默认CodeIgniter允许访问$ _get阵列。如果一些
 | 原因你想禁用它，集“allow_get_array '假。
 |
 | 警告：不推荐使用此功能，目前只
 | 向后兼容的目的！
 |
 */
$config['allow_get_array'] = TRUE;

/*
 |--------------------------------------------------------------------------
 | 错误日志记录阈值
 |--------------------------------------------------------------------------
 |
 | 你可以通过设置一个阈值在零记录错误使。这个
 | 阈值确定所记录的。阈值选项如下：
 |
 | 0 =禁用日志，错误日志关闭
 | 1 =错误信息（包括PHP错误）
 | 2 =调试消息
 | 3 =信息消息
 | 4 =所有的消息
 |
 |还可以传递一个数组与阈值水平来表现个人的错误类型
 |
 |array(2) = Debug Messages, 没有错误信息
 |
 |为直播网站你通常只能使错误（1）要记录否则
 |你的日志文件会很快。
 |
 */
$config['log_threshold'] = 4;

/*
 |--------------------------------------------------------------------------
 | 错误记录目录路径
 |--------------------------------------------------------------------------
 |
 |离开这个空白，除非你想把某些东西不是默认
 |应用/日志/目录。使用带斜杠的完整服务器路径。
 |
 */
$config['log_path'] = FCPATH.'log';

/*
 |--------------------------------------------------------------------------
 | 日志文件的扩展名
 |--------------------------------------------------------------------------
 |
 | 日志文件的默认文件名扩展名。
 | 默认的“PHP”允许通过基本脚本保护日志文件，
 | 当它们被存储在公共可访问目录下时。
 |
 | 注意：留空将默认为“PHP”。
 |
 */
$config['log_file_extension'] = '';

/*
 |--------------------------------------------------------------------------
 | 日志文件的权限
 |--------------------------------------------------------------------------
 |
 | 日志文件的权限|文件系统权限适用于新创建的日志文件。
 |
 | 重要：这必须是一个整数（没有引号），你必须使用八进制
 | 整数的符号（如0700, 0644等）
 */
$config['log_file_permissions'] = 0644;

/*
 |--------------------------------------------------------------------------
 | 日志的日期格式
 |--------------------------------------------------------------------------
 |
 | 各项记录都有一个相关的日期。可以使用php日期
 | 码来设定自己的日期格式
 |
 */
$config['log_date_format'] = 'Y-m-d H:i:s';

/*
 |--------------------------------------------------------------------------
 | 错误视图目录路径
 |--------------------------------------------------------------------------
 |
 | 离开这个空白，除非你想把某些东西不是默认
 | 应用/观点/错误/目录。使用带斜杠的完整服务器路径。
 |
 */
$config['error_views_path'] = '';

/*
 |--------------------------------------------------------------------------
 | 缓存目录的路径
 |--------------------------------------------------------------------------
 |
 | 除非您想设置默认值以外的其他部分，否则保留此空白。
 | 应用/缓存目录。使用带斜杠的完整服务器路径。
 |
 */
$config['cache_path'] = '';

/*
 |--------------------------------------------------------------------------
 | 包括查询字符串缓存
 |--------------------------------------------------------------------------
 |
 | 是否URL查询字符串时考虑发电
 | 输出缓存文件。有效选项如下：
 |
 |	FALSE      = 不启用
 |	TRUE       = 启用后，将所有查询参数考虑在内。
 |                请注意，这可能会导致大量的缓存
 |                文件生成相同的页面一遍又一遍。
 |	array('q') = 启用，但只考虑到指定的列表
 |                查询参数。
 |
 */
$config['cache_query_string'] = FALSE;

/*
 |--------------------------------------------------------------------------
 | 加密密钥
 |--------------------------------------------------------------------------
 |
 | 如果你使用加密类，你必须设置一个加密密钥。
 | 更多信息参见用户指南。
 | https://codeigniter.com/user_guide/libraries/encryption.html
 |
 */
$config['encryption_key'] = '';

/*
 |--------------------------------------------------------------------------
 | 会话变量
 |--------------------------------------------------------------------------
 |
 | “sess_driver”
 |
 | 存储驱动程序使用：文件，数据库，redis，memcached
 |
 | sess_cookie_name ' '
 |
 | 会话cookie的名称，必须只包含[ 0-9a-z_ ]字符
 |
 | sess_expiration ' '
 |
 | 秒你想要的会话持续数。
 | 设置为0（零）意味着到期时关闭浏览器。
 |
 | sess_save_path ' '
 |
 | 位置保存会话，驱动程序依赖。
 |
 | 的文件的驱动器，它是一个可写的目录路径。
 | 警告：只支持绝对路径！
 |
 | 的数据库驱动程序，它是一个表名。
 | 请读起来与其他会话司机格式手册。
 |
 | 重要：你需要设置一个有效的保存路径！
 |
 | sess_match_ip ' '
 |
 | 是否匹配用户的IP地址读取会话数据时。
 |
 | 警告：如果你使用的数据库驱动程序，不要忘记更新
 | 会话表的主键时更改此设置。
 |
 | sess_time_to_update ' '
 |
 | 多少秒CI再生之间的会话ID。
 |
 | sess_regenerate_destroy ' '
 |
 | 是否摧毁旧的会话ID关联的会话数据
 | 当自动再生的会话ID。当设置为false，数据
 | 将由垃圾回收器后删除。
 |
 | 其他会话cookie的设置与应用程序的其余部分共享，
 | 除“cookie_prefix '和' cookie_httponly '，忽视这。
 |C:\Users\Administrator.USER-20180225SL\AppData\Local\Temp
 |
 */
$config['sess_driver'] = 'files';
$config['sess_cookie_name'] = 'ci_session';
$config['sess_expiration'] = 7200;
//$config['sess_save_path'] = FCPATH.'tmp';
//$config['sess_save_path'] = 'C:\Users\Administrator.USER-20180225SL\AppData\Local\Temp';
$config['sess_save_path'] = FCPATH.'tmp';
$config['sess_match_ip'] = FALSE;
$config['sess_time_to_update'] = 300;
$config['sess_regenerate_destroy'] = FALSE;

/*
 |--------------------------------------------------------------------------
 | Cookie的相关变量
 |--------------------------------------------------------------------------
 |
 | 'cookie_prefix'   = Cookie的相关variablesset cookie名称前缀，如果你需要避免碰撞
 | 'cookie_domain'   = 设置站点范围内的 域名.com cookies
 | 'cookie_path'     = 通常是向前斜线。
 | 'cookie_secure'   = 只有在存在安全HTTPS连接时才设置cookie。
 | 'cookie_httponly' = cookie只能通过HTTP（无JavaScript）访问。
 |
 | 注意：这些设置（在“cookie_prefix和例外
 | ”cookie_httponly”）也会影响会议。
 |
 */
$config['cookie_prefix']	= '';
$config['cookie_domain']	= '';
$config['cookie_path']		= '/';
$config['cookie_secure']	= FALSE;
$config['cookie_httponly'] 	= FALSE;

/*
 |--------------------------------------------------------------------------
 | 规范换行
 |--------------------------------------------------------------------------
 |
 | 决定是否规范输入数据中的换行符，
 | 代替\r\n，R的意思，\n事件与php_eol价值。
 | 警告：此功能已被废弃，目前只
 | 为了向后兼容目的！
 |
 */
$config['standardize_newlines'] = FALSE;

/*
 |--------------------------------------------------------------------------
 | 全球的XSS过滤
 |--------------------------------------------------------------------------
 |
 | 确定XSS过滤器总是活跃的时候，邮寄或
 | cookie数据时
 |
 | 警告：不推荐使用此功能，目前只
 | 向后兼容的目的！
 */
$config['global_xss_filtering'] = FALSE;

/*
 |--------------------------------------------------------------------------
 | 跨站点请求伪造
 |--------------------------------------------------------------------------
 | 跨站点请求forgeryenables CSRF令牌将饼干。当设置为true时，令牌将为
 | 在提交的检查。如果您正在接受用户数据，那么它是强的。
 | 推荐CSRF保护启用。
 |
 | 'csrf_token_name' = 令牌名称
 | 'csrf_cookie_name' = cookie的名字
 | 'csrf_expire' = 令牌应该过期的秒数。
 | 'csrf_regenerate' = 在每次提交时重新生成令牌
 | 'csrf_exclude_uris' = URI忽视CSRF检查阵列
 */
$config['csrf_protection'] = FALSE;
$config['csrf_token_name'] = 'csrf_test_name';
$config['csrf_cookie_name'] = 'csrf_cookie_name';
$config['csrf_expire'] = 7200;
$config['csrf_regenerate'] = TRUE;
$config['csrf_exclude_uris'] = array();

/*
 |--------------------------------------------------------------------------
 | 输出压缩
 |--------------------------------------------------------------------------
 |
 | 启用gzip压缩输出更快的页面加载。当启用，
 | 输出级将测试您的服务器是否支持gzip。
 | 即使有，但是，并不是所有的浏览器都支持压缩
 | 所以如果你确信你能处理它使游客。
 |
 | 如果只使用zlib.output_compression关闭在php.ini。
 | 请不要用它连同httpd电平输出压缩。
 |
 | 非常重要：如果你得到一个空白的页面压缩时启用
 | 意味着你过早地输出到浏览器的东西。它可以
 | 甚至可以在一个脚本的最后一行空格。对于
 | 压缩工作，没有什么可以在输出缓冲区被称为发
 | 由输出级。不要“回声”任何启用压缩的值。
 |
 */
$config['compress_output'] = FALSE;

/*
 |--------------------------------------------------------------------------
 | 掌握时间参考
 |--------------------------------------------------------------------------
 |
 | 选择“本地”或任何PHP支持的时区。这种偏好告诉
 | 是否使用本地时间服务器作为主'现在'系统
 | 参考，或将其转换为配置一个时区。看日期
 | 关于日期的处理信息的用户指南帮助页面。
 |
 */
$config['time_reference'] = 'local';

/*
 |--------------------------------------------------------------------------
 | 重写PHP短标签
 | --------------------------------------------------------------------------
 |
 | 如果你的PHP安装没有短标签支持使CI
 | 改写标签上的苍蝇，使您能够利用语法
 | 你查看文件。选项是真还是假（布尔）
 |
 | 注：你需要有一个可以正常运行的。
 |
 */
$config['rewrite_short_tags'] = FALSE;

/*
 |--------------------------------------------------------------------------
 | 反向代理服务器IP
 | --------------------------------------------------------------------------
 |
 |如果您的服务器|背后是一个反向代理，你必须白名单的代理
 | IP地址由CodeIgniter应该相信标题如
 |为http_x_forwarded_for和http_client_ip正确识别
 |访问者的IP地址。
 |
 |可以使用数组或逗号分隔的代理服务器地址列表，
 |以及指定整个子网。下面是几个例子：
 |
 |逗号：'10.0.1.200192.168.5.0 / 24
 |数组：ARRAY（'10.0.1.200 '，' 192.168.5.0 / 24“）
 */
$config['proxy_ips'] = '';



//字体设置路径
$config['fonts_path'] = BASEPATH . 'fonts/';
//资源引入路径
$config['public_res_xb'] = '/public/admin_20180322/resource/';

//时区设置
date_default_timezone_set('Asia/ShangHai');
$config['time_zone'] = date_default_timezone_get();
